{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "digits", "batch_input_shape": [null, 784]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "digits"}, {"config": {"units": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "dtype": "float32"}, "class_name": "Dense", "inbound_nodes": [[["digits", 0, 0, {}]]], "name": "dense_1"}, {"config": {"units": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "dtype": "float32"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"config": {"units": 10, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "predictions", "dtype": "float32"}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "predictions"}], "output_layers": [["predictions", 0, 0]], "name": "3_layer_mlp", "input_layers": [["digits", 0, 0]]}, "class_name": "Model"}