{"class_name": "Sequential", "config": {"name": "sequential_6", "layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 784], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_12", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "dtype": "float32", "name": "dropout_6", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_13", "bias_constraint": null, "activation": "softmax"}}]}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}